# В коде сторонней библиотеки обнаружился баг.
# Вместо отсортированного массива строк библиотека возвращает массив случайно упорядоченных строк.
# К счастью, в каждую строку в случайной позиции библиотека записывает порядковый индекс – позицию,
# где строка должна быть в выходном массиве, например, "str2ing".
# Ваша задача обработать баг библиотеки и написать функцию, которая:
# - извлечёт индекс из строки;
# - с помощью индекса расположит строку в нужной позиции.
# str3
# 1smth
# bla2bla
numbers = 2 * 10 ** 9
numbers2 = 2 * 10 ** 9
result = numbers2 + numbers
print(result)
print(type(result))