# 45.	Написать программу преобразования десятичного числа в двоичное
from useFulFutires.IsNumber import isNumber
from useFulFutires.ToBinary import toBinary

print('45.	Написать программу преобразования десятичного числа в двоичное')
number = isNumber()
result = toBinary(number)
print(result)