# 39.	Реализовать алгоритм задания случайных чисел. Без использования встроенного генератора псевдослучайных чисел
print('39.	Реализовать алгоритм задания случайных чисел. Без использования встроенного генератора псевдослучайных чисел')

def randomNumber(maxValue):
    return